---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.ZoneEquipmentBehavior
source: html/fc0cef9a-4418-83f4-faf7-d7628f2f3149.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentBehavior

The behavior of zone equipment associated with spaces.

## Syntax (C#)
```csharp
public enum ZoneEquipmentBehavior
```